/*Задание 2
2. Даны натуральные числа M и N. Вывести на экран процесс их умножения в столбик:
123
х 45
------
615
492
------
5535*/
/*Задание 3
20. Для двух заданных матриц A(n,n) и B(n,n) проверить, можно ли получить вторую
из первой применением конечного числа (не более четырех) операций
транспонирования относительно главной и побочной диагоналей*/
/*Задание 4
20. Задан набор ключевых слов, а также текст, в котором хранится длинный список названий
книг. Выбрать названия, содержащие хотя бы одно из заданных ключевых слов.*/
#include "main.h"

int main(void)
{
    menu();
    return 0;
}
