#ifndef LIST_H
#define LIST_H

/*struct element //Структура с инфополями и адресным полем
{
 int x; //Инфополе. значения из x будут передаваться в список
 element *Next; //Адресное поле
};

class List //Класс Список
{
 element *Head; //Указатель на последний активный элемент или просто голова списка
 public:
  List() {Head=NULL;} //Конструктор и инициализация указателя пустым значением
 ~List(); //Деструктор. Далее он вынесен за класс
 void Add(int x); //Функция для добавления значений в список
 void Show(); //Функция для отображения списка на экране
};*/

#endif // LIST_H
