#include <iostream>
#include <list.h>
//#include "cpp_lib.h"

using namespace std;
/*Линейный список
Реализовать класс ЛИНЕЙНЫЙ СПИСОК (целых чисел). Требуемые методы: конструктор, деструктор,
вставка элемента, поиск элемента, удаление элемента*/

main()
{
   /* int N;
    int x;
    List lst;

    cout<<"N = ";
    cin>>N;

    for (int i=0;i<N;i++)
    {
        cout<<i+1<<". x = ";
        cin>>x;
        lst.Add(x);
    }

    lst.Show();
    getch();*/

}

